# IFCParameter Template Export Revit Schedules Property

Source: https://www.revitapidocs.com/2026/c9823c5e-caeb-15d2-a707-b14dc7a001a7.htm

---

| IFCParameter Template Export Revit Schedules Property |
| --- |

The option to export Revit schedules to IFC.
 If true, then all Revit schedules not excluded will be exported.
 If false, then no Revit schedules will be exported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool ExportRevitSchedules { get; set; }
```

```
Public Property ExportRevitSchedules As Boolean
	Get
	Set
```

```
public:
property bool ExportRevitSchedules {
	bool get ();
	void set (bool value);
}
```

```
member ExportRevitSchedules : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace